Demo_Production/src/InformationRegisters/ЖурналЗаписейИнтегарций/ЖурналЗаписейИнтегарций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналЗаписейИнтегарций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ИмяСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидСервиса</name>
    <type>
      <types>EnumRef.ВидыСервисовИнтеграций</types>
    </type>
  </resources>
  <resources>
    <name>ВходящийЗапрос</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Ответ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИдентиифкаторЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Demo_Production/src/HTTPServices/HTTPTestVer1/Module.bsl
Функция MessageDeleteSomething(Запрос)
	
	//тест для запроса
	//http://localhost/Demo/hs/testver1/DeleteSomething
	
	Попытка
		ЗаписьНачало = РегистрыСведений.ЖурналЗаписейИнтегарций.СоздатьМенеджерЗаписи();
		ЗаписьНачало.Период = ТекущаяДатаСеанса();
		ЗаписьНачало.ИмяСервиса = "HTTPTestVer1";
		ЗаписьНачало.ВидСервиса = Перечисления.ВидыСервисовИнтеграций.HTTP;
		ЗаписьНачало.ВходящийЗапрос = Запрос.БазовыйURL+Запрос.HTTPМетод;
		ЗаписьНачало.ИдентиифкаторЗаписи = Новый УникальныйИдентификатор();
		ЗаписьНачало.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Запись регистра ЖурналЗаписейИнтегарций НачалоЗаписи",УровеньЖурналаРегистрации.Ошибка,
			,Запрос,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	///////////////////////////////////
	
	Соотв = Запрос.ПараметрыЗапроса;
	СтрОтве = Новый Структура();
	Для Каждого эл Из Соотв Цикл
		СтрОтве.Вставить(эл.Ключ,эл.Значение);
	КонецЦикла;
	СтрОтве.Вставить("База",СтрокаСоединенияИнформационнойБазы());
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,СтрОтве);
	СтрОтвет = ЗаписьJSON.Закрыть();
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(СтрОтвет);
	Ответ.Заголовки.Вставить("Content-type","application/json");
	
	/////////////////////////////////////
	
	Попытка
		ЗаписьКонец = РегистрыСведений.ЖурналЗаписейИнтегарций.СоздатьМенеджерЗаписи();
		ЗаписьКонец.Период = ЗаписьНачало.Период;
		ЗаписьКонец.ИдентиифкаторЗаписи = ЗаписьНачало.ИдентиифкаторЗаписи;
		ЗаписьКонец.Прочитать();
		Если ЗаписьКонец.Выбран() Тогда
			ЗаписьКонец.Ответ = СтрОтвет;
			ЗаписьКонец.Записать();	
		КонецЕсли;	
	Исключение
		ЗаписьЖурналаРегистрации("Запись регистра ЖурналЗаписейИнтегарций КонецЗаписи",УровеньЖурналаРегистрации.Ошибка,
			,Запрос,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

	Возврат Ответ;
	
КонецФункции

Функция MessagePostSomething(Запрос)
	
	//тест для запроса
	//http://localhost/Demo/hs/testver1/PostSomething
	//{
    //"from": "Postman",
    //"test": "Yes"
	//}
	 
	Попытка
		ЗаписьНачало = РегистрыСведений.ЖурналЗаписейИнтегарций.СоздатьМенеджерЗаписи();
		ЗаписьНачало.Период = ТекущаяДатаСеанса();
		ЗаписьНачало.ИмяСервиса = "HTTPTestVer1";
		ЗаписьНачало.ВидСервиса = Перечисления.ВидыСервисовИнтеграций.HTTP;
		ЗаписьНачало.ВходящийЗапрос = Запрос.БазовыйURL+Запрос.HTTPМетод;
		ЗаписьНачало.ИдентиифкаторЗаписи = Новый УникальныйИдентификатор();
		ЗаписьНачало.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Запись регистра ЖурналЗаписейИнтегарций НачалоЗаписи",УровеньЖурналаРегистрации.Ошибка,
			,Запрос,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	///////////////////////////////////
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку());
	ВхДанные = ПрочитатьJSON(ЧтениеJSON);
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,ВхДанные);
	СтрОтвет = ЗаписьJSON.Закрыть();
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(СтрОтвет);
	Ответ.Заголовки.Вставить("Content-type","application/json");	
	
	/////////////////////////////////////
	
	Попытка
		ЗаписьКонец = РегистрыСведений.ЖурналЗаписейИнтегарций.СоздатьМенеджерЗаписи();
		ЗаписьКонец.Период = ЗаписьНачало.Период;
		ЗаписьКонец.ИдентиифкаторЗаписи = ЗаписьНачало.ИдентиифкаторЗаписи;
		ЗаписьКонец.Прочитать();
		Если ЗаписьКонец.Выбран() Тогда
			ЗаписьКонец.Ответ = СтрОтвет;
			ЗаписьКонец.Записать();	
		КонецЕсли;	
	Исключение
		ЗаписьЖурналаРегистрации("Запись регистра ЖурналЗаписейИнтегарций КонецЗаписи",УровеньЖурналаРегистрации.Ошибка,
			,Запрос,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция MessageGetMessage(Запрос)
	
	//тест для запроса
	//http://localhost/Demo/hs/testver1/GetMessage?par1=2&par2=3
	
	Попытка
		ЗаписьНачало = РегистрыСведений.ЖурналЗаписейИнтегарций.СоздатьМенеджерЗаписи();
		ЗаписьНачало.Период = ТекущаяДатаСеанса();
		ЗаписьНачало.ИмяСервиса = "HTTPTestVer1";
		ЗаписьНачало.ВидСервиса = Перечисления.ВидыСервисовИнтеграций.HTTP;
		ЗаписьНачало.ВходящийЗапрос = Запрос.БазовыйURL+Запрос.HTTPМетод;
		ЗаписьНачало.ИдентиифкаторЗаписи = Новый УникальныйИдентификатор();
		ЗаписьНачало.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("Запись регистра ЖурналЗаписейИнтегарций НачалоЗаписи",УровеньЖурналаРегистрации.Ошибка,
			,Запрос,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	///////////////////////////////////
		
	Соотв = Запрос.ПараметрыЗапроса;
	СтрОтве = Новый Структура();
	Для Каждого эл Из Соотв Цикл
		СтрОтве.Вставить(эл.Ключ,эл.Значение);
	КонецЦикла;
	СтрОтве.Вставить("База",СтрокаСоединенияИнформационнойБазы());
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,СтрОтве);
	СтрОтвет = ЗаписьJSON.Закрыть();
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(СтрОтвет);
	Ответ.Заголовки.Вставить("Content-type","application/json");
	
	/////////////////////////////////////
	
	Попытка
		ЗаписьКонец = РегистрыСведений.ЖурналЗаписейИнтегарций.СоздатьМенеджерЗаписи();
		ЗаписьКонец.Период = ЗаписьНачало.Период;
		ЗаписьКонец.ИдентиифкаторЗаписи = ЗаписьНачало.ИдентиифкаторЗаписи;
		ЗаписьКонец.Прочитать();
		Если ЗаписьКонец.Выбран() Тогда
			ЗаписьКонец.Ответ = СтрОтвет;
			ЗаписьКонец.Записать();	
		КонецЕсли;	
	Исключение
		ЗаписьЖурналаРегистрации("Запись регистра ЖурналЗаписейИнтегарций КонецЗаписи",УровеньЖурналаРегистрации.Ошибка,
			,Запрос,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции
